app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @title_page = "Panel administracyjny"
    @user = User.find(session[:user_id])

INSERT INTO "users" ("account_type", "created_at", "favourite", "mail", "name", "password", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @user.account_type="user"
    respond_to do |format|
      if @user.save